<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<title>Modelado de Objetos del Negocio::Repositorio de arquitectura</title>
<link href="../../../../css/ea.css" rel="stylesheet" type="text/css" />
<script language="JavaScript" src="../../../../js/displayToc.js" type="text/javascript"></script>
<script>

  function switchProjectProperties() {
			if (document.getElementById("proj00").style.display == "none") {
				document.getElementById("proj00").style.display = "revert";
				document.getElementById("proj01").style.display = "revert";
				document.getElementById("proj02").style.display = "revert";
				document.getElementById("proj03").style.display = "revert";
				document.getElementById("proj04").style.display = "revert";
				document.getElementById("proj05").style.display = "revert";
			} else {
				document.getElementById("proj00").style.display = "none";
				document.getElementById("proj01").style.display = "none";
				document.getElementById("proj02").style.display = "none";
				document.getElementById("proj03").style.display = "none";
				document.getElementById("proj04").style.display = "none";
				document.getElementById("proj05").style.display = "none";
			}
}

		function switchAdvancedProperties(){

			if (document.getElementById("adv00").style.display == "none") {;
				document.getElementById("adv00").style.display = "revert";
				document.getElementById("adv01").style.display = "revert";
			} else {
				document.getElementById("adv00").style.display = "none";
				document.getElementById("adv01").style.display = "none";
			}
		}
		function initPage()
        {			
			var divs = document.getElementsByClassName("ObjectDetailsNotes");
			for (var j = 0; j < divs.length; j++) {
				var tmpStr = divs[j].innerHTML;
				tmpStr = tmpStr.replace(/&gt;/g, ">");
				tmpStr = tmpStr.replace(/&lt;/g, "<");

				tmpStr = tmpStr.replace(/#gt;/g, "&gt;");
				tmpStr = tmpStr.replace(/#lt;/g, "&lt;");

				divs[j].innerHTML = tmpStr;
			}

            if (document.getElementById('TableGroup') != null)
            {
                toggleItem(document.getElementById('TableGroup').getElementsByTagName('li')[0].id.replace("Title", ""));
            }

        }
</script>
<style>

</style>
</head>
<body onload="initPage();">
<div class="section group" >

		<div class="col span_2_of_2 header_frame">
			<h1> Modelado de Objetos del Negocio::Repositorio de arquitectura </h1>
			<!-- <img class="header_image" src="../../../../images/ea-banner.png" align="right" alt="Header Image" />-->
			<img class="header_image" src="../../../../images/ea-banner.png" align="right" alt="Header Image" />
		</div>
		<div class="col span_2_of_2 breadcrumb_frame">
			<p><a href="../../../../index.htm">Adaptacion BMM</a> / <a href="../../EA1.htm">ADM_TOGAF</a> / <a href="../EA3.htm">Modelado de elementos del negocio</a> / <a href="EA103.htm">Modelado de Objetos del Negocio</a> / <a href="EA262.htm">Repositorio de arquitectura</a></p>
		</div>
			
		<table class="contentmaintable">
			<!-- <tfoot>
				<tr>
					<td>foot1</td>
					<td>foot2</td>
				</tr>
			</tfoot> -->
			<tbody>
				<tr>
					<td class="indexcell">
						<div class="projectBrowserTitle">Project: </div>
						<ul>
<a href="EA103.htm">Modelado de Objetos del Negocio</a></ul>

					</td>
					<td class="contentcell"><div class="pageHeader"></div>
<div class="PageBody">
	<span class="ObjectTitle">Repositorio de arquitectura  : Public  &lt;&lt;recurso: Entradas arquitectónicas&gt;&gt; Class</span>
	<table border="0" class="ObjectDetails">
		<tr>
			<td width="15%" class="ObjectDetailsTopic">Created:</td>
			<td width="85%" class="ObjectDetailsValue">17/10/2022 1:09:00</td>
		</tr>
		<tr>
			<td class="ObjectDetailsTopic">Modified:</td>
			<td class="ObjectDetailsValue">04/11/2022 12:24:15</td>
		</tr>
		<tr style="height: 10px"><td colspan="2"></td></tr>
		<tr>
			<td class="ObjectDetailsTopic"><button onclick="switchProjectProperties()"><img src="../../../../images/plus03.gif" align="absmiddle" id="proj" /></button>Project:</td>
			<td class="ObjectDetailsValue"></td>
		</tr>
		<tr id="proj00" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Author:</td>
			<td class="ObjectDetailsValue">Wanda Mayrena</td>
		</tr>
		<tr id="proj01" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Version:</td>
			<td class="ObjectDetailsValue">1.0</td>
		</tr>
		<tr id="proj02" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Phase:</td>
			<td class="ObjectDetailsValue">1.0</td>
		</tr>
		<tr id="proj03" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Status:</td>
			<td class="ObjectDetailsValue">Proposed</td>
		</tr>
		<tr id="proj04" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Complexity:</td>
			<td class="ObjectDetailsValue">Easy</td>
		</tr>
		<tr id="proj05" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Difficulty:</td>
			<td class="ObjectDetailsValue"></td>
		</tr>
		<tr id="proj06" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Priority:</td>
			<td class="ObjectDetailsValue"></td>
		</tr>
		<tr id="proj05" style="display: none;">
			<td class="ObjectDetailsTopic" >Multiplicity:</td>
			<td class="ObjectDetailsValue"></td>
		</tr>
		<tr>
			<td class="ObjectDetailsTopic"><button onclick="switchAdvancedProperties()"><img src="../../../../images/plus03.gif" align="absmiddle" id="adv" /></button>Advanced:</td>
			<td class="ObjectDetailsValue"></td>
		</tr>
		<tr id="adv00" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">UUID:</td>
			<td class="ObjectDetailsValue">{94EE0998-2584-4391-AE53-314DF4AA752E}</td>
		</tr>
		<tr id="adv01" style="display: none;">
			<td class="ObjectDetailsTopic" style="padding-left: 18px;">Appears In:</td>
			<td class="ObjectDetailsValue"><a href="../EA4/EA2/EA6/EA1284.htm">Fase Preliminar</a>, <a href="../EA4/EA2/EA5/EA1277.htm">Fase de Gestión de Requisitos</a>, <a href="../EA4/EA1/EA5/EA1048.htm">Fase de Gestión de Requisitos</a>, <a href="../EA4/EA1/EA6/EA1133.htm">Fase Prelimilar</a>, <a href="../EA4/EA2/EA1/EA1222.htm">Fase A: Visión de la Arquitectura</a>, <a href="../EA4/EA2/EA2/EA1234.htm">Fase B: Arquitectura de Negocios</a>, <a href="../EA4/EA2/EA3/EA2/EA1257.htm">Fase C: Arquitecturas de Sistemas de Información - Arquitectura de Datos</a>, <a href="../EA4/EA2/EA3/EA1/EA1247.htm">Fase C: Arquitecturas de Sistemas de Información - Arquitectura de Aplicaciones</a>, <a href="../EA4/EA2/EA4/EA1267.htm">Fase D: Arquitectura Tecnológica</a>, <a href="EA101.htm">Modelado de Objetos del Negocio</a>, <a href="../EA4/EA1/EA1/EA3/EA403.htm">Sub-proceso 6."Definir el alcance"</a>, <a href="../EA4/EA1/EA2/EA462.htm">Fase B: Arquitectura de Negocios</a>, <a href="../EA4/EA1/EA1/EA306.htm">Fase A: Visión de la Arquitectura</a>, <a href="../EA4/EA1/EA1/EA4/EA415.htm">Sub-proceso"2. Identificar las partes interesadas y los requisitos"</a>, <a href="./EA6/EA292.htm">Fase Preliminar</a>, <a href="../EA4/EA1/EA3/EA1/EA611.htm">Fase C: Arquitecturas de Sistemas de Información - Arquitectura de Aplicaciones</a>, <a href="./EA5/EA288.htm">Fase A: Visión de la arquitectura</a>, <a href="./EA1/EA266.htm">Fase B: Arquitectura del negocio</a>, <a href="./EA2/EA1/EA273.htm">Fase C: Arquitectura SI - Arquitectura de Aplicaciones</a>, <a href="./EA2/EA2/EA277.htm">Fase C: Arquitectura SI - Arquitectura de Datos</a>, <a href="./EA3/EA281.htm">Fase D: Arquitectura tecnológica</a>, <a href="../EA4/EA1/EA2/EA1/EA517.htm">Sub-proceso "1. Seleccionar modelos de referencia,  puntos de vista y herramientas"</a>, <a href="../EA4/EA1/EA2/EA2/EA559.htm">Sub-proceso "4. Realizar análisis de brechas"</a>, <a href="../EA4/EA1/EA3/EA2/EA759.htm">Fase C: Arquitecturas de Sistemas de Información - Arquitectura de Datos</a>, <a href="../EA4/EA1/EA3/EA2/EA1/EA813.htm">Sub-proceso "1. Seleccionar modelos de referencia,  puntos de vista y herramientas"</a>, <a href="../EA4/EA1/EA3/EA2/EA1/EA1/EA844.htm">Sub-proceso Proceso para desarrollar una arquitectura de datos</a>, <a href="../EA4/EA1/EA3/EA1/EA1/EA669.htm">Sub-proceso "1. Seleccionar modelos de referencia,  puntos de vista y herramientas"</a>, <a href="../EA4/EA1/EA3/EA1/EA1/EA1/EA701.htm">Sub-proceso "Proceso para desarrollar arquitectura de aplicación"</a>, <a href="../EA4/EA1/EA4/EA890.htm">Fase D: Arquitectura Tecnológica</a>, <a href="../EA4/EA1/EA4/EA1/EA938.htm">Sub-proceso "1. Seleccionar modelos de referencia,  puntos de vista y herramientas"</a>, <a href="../EA4/EA1/EA4/EA1/EA1/EA982.htm">Sub-proceso "Proceso para desarrollar una Arquitectura Tecnológica"</a>, <a href="./EA4/EA285.htm">Fase Gestión de Requisitos</a></td>
		</tr>
	</table>
	<div class="ObjectDetailsNotes">&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura (&lt;i&gt;Parte IV: Marco de contenido de arquitectura, 32.2.5 Repositorio de arquitectura&lt;/i&gt;)&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;El Repositorio de Arquitectura act&#250;a como un &#225;rea de retenci&#243;n para todos los proyectos relacionados con la arquitectura dentro de la empresa. El repositorio permite a los proyectos administrar sus entregables, localizar activos reutilizables y publicar los resultados a las partes interesadas y otras partes interesadas.&lt;br/&gt;&lt;br/&gt;La &lt;i&gt;parte V: Continuum empresarial y herramientas, 37. Repositorio de arquitectura &lt;/i&gt;ofrece una descripci&#243;n detallada del contenido de un repositorio de arquitectura.&lt;br/&gt;&lt;br/&gt;Operar una capacidad de arquitectura madura dentro de una gran empresa crea un gran volumen de resultados arquitect&#243;nicos. La administraci&#243;n efectiva y el aprovechamiento de estos productos de trabajo arquitect&#243;nico requieren una taxonom&#237;a formal para diferentes tipos de activos arquitect&#243;nicos junto con procesos y herramientas dedicados para el almacenamiento de contenido arquitect&#243;nico.&lt;br/&gt;&lt;br/&gt;Esta secci&#243;n proporciona un marco estructural para un repositorio de arquitectura que permite a una empresa distinguir entre diferentes tipos de activos arquitect&#243;nicos que existen en diferentes niveles de abstracci&#243;n en la organizaci&#243;n. Este repositorio de arquitectura es una parte del repositorio empresarial m&#225;s amplio, que proporciona la capacidad de vincular activos arquitect&#243;nicos a componentes de los repositorios de dise&#241;o detallado, implementaci&#243;n y administraci&#243;n de servicios.&lt;br/&gt;&lt;br/&gt;A un alto nivel, se espera que las siguientes clases de informaci&#243;n arquitect&#243;nica se lleven a cabo dentro de un Repositorio de Arquitectura:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;El &lt;b&gt;metamodelo de arquitectura&lt;/b&gt; describe la aplicaci&#243;n personalizada organizativamente de un marco de arquitectura, incluido un m&#233;todo para el desarrollo de arquitectura y un metamodelo para el contenido de arquitectura.&lt;/li&gt;&lt;li&gt;La &lt;b&gt;capacidad de arquitectura&lt;/b&gt; define los par&#225;metros, estructuras y procesos que admiten el gobierno del repositorio de arquitectura&lt;/li&gt;&lt;li&gt;El &lt;b&gt;Paisaje arquitect&#243;nico&lt;/b&gt; presenta una representaci&#243;n arquitect&#243;nica de los activos en uso, o planificados, por la empresa en momentos particulares en el tiempo.&lt;/li&gt;&lt;li&gt;La &lt;b&gt;Base de Informaci&#243;n de Est&#225;ndares&lt;/b&gt; captura los est&#225;ndares con los que deben cumplir las nuevas arquitecturas, que pueden incluir est&#225;ndares de la industria, productos y servicios seleccionados de proveedores o servicios compartidos ya implementados dentro de la organizaci&#243;n.&lt;/li&gt;&lt;li&gt;La &lt;b&gt;biblioteca de referencia&lt;/b&gt; proporciona directrices, plantillas, patrones y otras formas de material de referencia que se pueden aprovechar para acelerar la creaci&#243;n de nuevas arquitecturas para la empresa.&lt;/li&gt;&lt;li&gt;El &lt;b&gt;registro de gobierno &lt;/b&gt;proporciona un registro de la actividad de gobierno en toda la empresa&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;El &lt;b&gt;Repositorio de requisitos de arquitectura&lt;/b&gt; proporciona una vista de todos los requisitos de arquitectura autorizados que se han acordado con la Junta de Arquitectura&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;El &lt;b&gt;Panorama de Soluciones&lt;/b&gt; presenta una representaci&#243;n arquitect&#243;nica de los Bloques de Construcci&#243;n de Soluciones (SB) que soportan el Paisaje de Arquitectura que han sido planificados o implementados por la empresa&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;b&gt;37.2 Paisaje Arquitect&#243;nico&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;El paisaje arquitect&#243;nico tiene puntos de vista arquitect&#243;nicos del estado de la empresa en puntos particulares en el tiempo. Debido al gran volumen y las diversas necesidades de las partes interesadas en toda una empresa, el panorama de la arquitectura se divide en tres niveles de granularidad:&lt;br/&gt;&lt;br/&gt;&lt;ol&gt;<br />&lt;li&gt;&lt;b&gt;Las arquitecturas estrat&#233;gicas&lt;/b&gt; (&lt;i&gt;Parte I, 3.74 Arquitectura estrat&#233;gica&lt;/i&gt;) muestran una visi&#243;n resumida a largo plazo de toda la empresa. Las arquitecturas estrat&#233;gicas proporcionan un marco organizativo para la actividad operativa y de cambio y permiten establecer la direcci&#243;n a nivel ejecutivo.&lt;/li&gt;&lt;li&gt;&lt;b&gt;Las arquitecturas de segmento&lt;/b&gt; (&lt;i&gt;Parte I, 3.64 Arquitectura de segmentos&lt;/i&gt;) proporcionan modelos operativos m&#225;s detallados para las &#225;reas dentro de una empresa. Las arquitecturas de segmento se pueden utilizar a nivel de programa o portafolio para organizar y alinear operativamente una actividad de cambio m&#225;s detallada.&lt;/li&gt;&lt;li&gt;&lt;b&gt;Las arquitecturas de capacidad&lt;/b&gt; (&lt;i&gt;Parte I, 3.31 Arquitectura de capacidad&lt;/i&gt;) muestran de una manera m&#225;s detallada c&#243;mo la empresa puede admitir una unidad particular de capacidad. Las arquitecturas de capacidad se utilizan para proporcionar una visi&#243;n general de la capacidad actual, la capacidad objetivo y los incrementos de capacidad y permiten que los paquetes de trabajo y proyectos individuales se agrupen dentro de portafolios y programas administrados.&lt;/li&gt;&lt;/ol&gt;<br />&lt;br/&gt;&lt;b&gt;37.3 Biblioteca de referencia&lt;/b&gt;&lt;br/&gt;&lt;b&gt;&lt;br/&gt;&lt;/b&gt;La Biblioteca de Referencia proporciona un repositorio para contener materiales de referencia que deben utilizarse para desarrollar arquitecturas. Los materiales de referencia en poder pueden obtenerse de una variedad de fuentes, incluyendo:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Organismos de normalizaci&#243;n&lt;/li&gt;&lt;li&gt;Proveedores de productos y servicios&lt;/li&gt;&lt;li&gt;Comunidades o foros de la industria&lt;/li&gt;&lt;li&gt;Plantillas est&#225;ndar&lt;/li&gt;&lt;li&gt;Pr&#225;cticas recomendadas para empresas&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;La biblioteca de referencia debe contener:&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Arquitecturas de referencia&lt;/li&gt;&lt;li&gt;Modelos de referencia&lt;/li&gt;&lt;li&gt;Biblioteca Viewpoint&lt;/li&gt;&lt;li&gt;Plantillas&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;b&gt;Nota&lt;/b&gt;&lt;br/&gt;Los t&#233;rminos &lt;i&gt;arquitectura de referencia&lt;/i&gt; y &lt;i&gt;modelo de referencia&lt;/i&gt; no se utilizan cuidadosamente en la mayor&#237;a de la literatura. La arquitectura de referencia y el modelo de referencia tienen la misma relaci&#243;n que la arquitectura y el modelo. Cualquiera de los dos puede existir como un estado gen&#233;rico o espec&#237;fico de la organizaci&#243;n. Normalmente, una arquitectura de referencia gen&#233;rica proporciona al equipo de arquitectura un esquema de la arquitectura de referencia espec&#237;fica de su organizaci&#243;n que se personalizar&#225; para una organizaci&#243;n espec&#237;fica. Por ejemplo, una arquitectura de referencia gen&#233;rica puede identificar que existe la necesidad de modelos de datos. Un ejemplo de una arquitectura de referencia es la arquitectura de referencia IT4IT que tambi&#233;n define un modelo de informaci&#243;n com&#250;n para la gesti&#243;n de TI. Otro ejemplo es TM Forum eTOM y SID como una arquitectura de referencia espec&#237;fica de la organizaci&#243;n.&lt;br/&gt;&lt;b&gt;&lt;br/&gt;&lt;/b&gt;Con el fin de segregar diferentes clases de materiales de referencia de arquitectura, la Biblioteca de Referencia puede utilizar el Continuo de Arquitectura como m&#233;todo para la clasificaci&#243;n.&lt;br/&gt;&lt;br/&gt;El Continuo de Arquitectura, (como se muestra en la Figura 37-2 de TOGAF), se puede ver como un esquema de clasificaci&#243;n de la Biblioteca de Referencia. Como tal, ilustra c&#243;mo las arquitecturas de referencia se pueden organizar en una amplia gama, desde arquitecturas b&#225;sicas y arquitecturas espec&#237;ficas de la industria, hasta una arquitectura espec&#237;fica de la organizaci&#243;n.&lt;br/&gt;&lt;br/&gt;Las necesidades empresariales y los requisitos empresariales se abordan disminuyendo la abstracci&#243;n de izquierda a derecha. El arquitecto normalmente encontrar&#225; m&#225;s elementos arquitect&#243;nicos reutilizables hacia la izquierda de la gama. Cuando no se encuentran elementos, los requisitos para los elementos faltantes se pasan a la izquierda del rango para su incorporaci&#243;n.&lt;br/&gt;&lt;br/&gt;A trav&#233;s de este ejercicio es importante tener en cuenta los conceptos de niveles y particiones. En diferentes niveles de granularidad puede haber materiales de referencia apropiados para el nivel, y se puede esperar que las particiones dentro del Paisaje Arquitect&#243;nico utilicen diferente material de referencia (ver &lt;i&gt;36. Particionamiento de arquitectura&lt;/i&gt; y &lt;i&gt;Parte III, 19. Aplicaci&#243;n del ADM en todo el panorama de la arquitectura&lt;/i&gt;).&lt;br/&gt;&lt;b&gt;&lt;br/&gt;&lt;/b&gt;&lt;b&gt;37.4 Base de informaci&#243;n sobre normas&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.4.1 Visi&#243;n general&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />La Base de Informaci&#243;n de Est&#225;ndares proporciona un &#225;rea de repositorio para contener un conjunto de especificaciones, a las que las arquitecturas deben ajustarse. El establecimiento de una base de informaci&#243;n de est&#225;ndares proporciona una base inequ&#237;voca para la gobernanza de la arquitectura porque:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Las normas son f&#225;cilmente accesibles para los proyectos y, por lo tanto, las obligaciones del proyecto pueden entenderse y planificarse para&lt;/li&gt;&lt;li&gt;Las normas se establecen de manera clara e inequ&#237;voca, de modo que el cumplimiento pueda evaluarse objetivamente.&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.4.2 Tipos de norma&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />Los est&#225;ndares generalmente se dividen en tres clases:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;&lt;i&gt;Obligaciones legales y regulatorias:&lt;/i&gt;&lt;/b&gt;&lt;i&gt; &lt;/i&gt;estas normas son obligatorias por ley y, por lo tanto, una empresa debe cumplir o enfrentar graves consecuencias.&lt;/li&gt;&lt;li&gt;&lt;b&gt;&lt;i&gt;Est&#225;ndares de la industria:&lt;/i&gt;&lt;/b&gt;&lt;b&gt; &lt;/b&gt;estos est&#225;ndares son establecidos por organismos de la industria, como The Open Group, y luego son seleccionados por la empresa para su adopci&#243;n.&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Los est&#225;ndares de la industria ofrecen potencial para la interoperaci&#243;n y el intercambio entre empresas, pero tambi&#233;n est&#225;n fuera del control de la empresa y, por lo tanto, deben monitorearse activamente.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;&lt;i&gt;Est&#225;ndares organizacionales:&lt;/i&gt;&lt;/b&gt;&lt;i&gt; &lt;/i&gt;estos est&#225;ndares se establecen dentro de la organizaci&#243;n y se basan en la aspiraci&#243;n del negocio (por ejemplo, selecci&#243;n de aplicaciones est&#225;ndar para apoyar la consolidaci&#243;n de los portafolios)&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Las normas organizacionales requieren procesos que permitan exenciones y la evoluci&#243;n de las normas.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.4.3 Ciclo de vida de los est&#225;ndares&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />Los est&#225;ndares generalmente no existen para todos los tiempos. Los nuevos est&#225;ndares se identifican y gestionan a trav&#233;s de un proceso de ciclo de vida.&lt;br/&gt;Por lo general, los est&#225;ndares pasan por las siguientes etapas:&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Norma propuesta:&lt;/b&gt; se ha identificado una norma potencial para la organizaci&#243;n, pero a&#250;n no se ha evaluado para su adopci&#243;n.&lt;/li&gt;&lt;li&gt;&lt;b&gt;Est&#225;ndar Provisional&lt;/b&gt; (tambi&#233;n conocido como &lt;b&gt;Est&#225;ndar de Prueba&lt;/b&gt;): un Est&#225;ndar Provisional ha sido identificado como un est&#225;ndar potencial para la organizaci&#243;n, pero no ha sido probado y probado a un nivel en el que su valor se entienda completamente.&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Los proyectos que deseen adoptar normas provisionales pueden hacerlo, pero en condiciones piloto espec&#237;ficas, de modo que la viabilidad de la norma pueda examinarse con m&#225;s detalle.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Est&#225;ndar &lt;/b&gt;(tambi&#233;n conocido como &lt;b&gt;est&#225;ndar activo&lt;/b&gt;): un est&#225;ndar define una soluci&#243;n convencional que generalmente debe usarse como el enfoque de elecci&#243;n.&lt;/li&gt;&lt;li&gt;&lt;b&gt;Est&#225;ndar de eliminaci&#243;n gradual&lt;/b&gt; (tambi&#233;n conocido como &lt;b&gt;est&#225;ndar obsoleto&lt;/b&gt;): un est&#225;ndar de eliminaci&#243;n gradual se acerca al final de su ciclo de vida &#250;til&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Los proyectos que est&#225;n reutilizando componentes existentes generalmente pueden continuar haciendo uso de las Normas de Eliminaci&#243;n Gradual. Por lo general, se desaconseja el despliegue de nuevas instancias de la norma de eliminaci&#243;n gradual.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Est&#225;ndar retirado&lt;/b&gt; (tambi&#233;n conocido como &lt;b&gt;est&#225;ndar obsoleto&lt;/b&gt;): un est&#225;ndar retirado ya no se acepta como v&#225;lido dentro del panorama&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;En la mayor&#237;a de los casos, se deben tomar medidas correctivas para eliminar el Est&#225;ndar Retirado del paisaje. La actividad de cambio en un est&#225;ndar retirado solo debe aceptarse como parte de un plan general de desmantelamiento.&lt;br/&gt;&lt;br/&gt;Todos los est&#225;ndares deben revisarse peri&#243;dicamente para garantizar que se encuentren dentro de la etapa correcta del ciclo de vida de los est&#225;ndares. Como parte de la gesti&#243;n del ciclo de vida de los est&#225;ndares, el impacto de cambiar el estado del ciclo de vida debe abordarse para comprender el impacto en el panorama de un cambio en los est&#225;ndares y planificar las acciones adecuadas para abordarlo.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.4.4 Clasificaci&#243;n de normas dentro de la Base de Informaci&#243;n de Normas&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />Los est&#225;ndares dentro de la Base de Informaci&#243;n de Est&#225;ndares se clasifican de acuerdo con los bloques de construcci&#243;n dentro del metamodelo de contenido TOGAF. Cada entidad metamodelo puede potencialmente tener est&#225;ndares asociados con ella (por ejemplo, Servicio de Negocios, Componente de Tecnolog&#237;a).&lt;br/&gt;&lt;br/&gt;Las normas pueden estar relacionadas con bloques de construcci&#243;n &quot;aprobados&quot; (por ejemplo, una lista de componentes tecnol&#243;gicos est&#225;ndar) o pueden especificar el uso apropiado de un bloque de construcci&#243;n (por ejemplo, escenarios en los que la infraestructura de mensajer&#237;a es apropiada, se definen los est&#225;ndares de comunicaci&#243;n de aplicaciones).&lt;br/&gt;&lt;br/&gt;En el nivel superior, los est&#225;ndares se clasifican de acuerdo con los dominios de arquitectura TOGAF, incluidas las siguientes &#225;reas:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Est&#225;ndares de Negocio:&lt;/b&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Funciones empresariales compartidas est&#225;ndar&lt;/li&gt;&lt;li&gt;Definiciones est&#225;ndar de roles y actores&lt;/li&gt;&lt;li&gt;Normas de seguridad y gobernanza para la actividad empresarial&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Est&#225;ndares de datos:&lt;/b&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Codificaci&#243;n est&#225;ndar y valores para los datos&lt;/li&gt;&lt;li&gt;Estructuras y formatos est&#225;ndar para datos&lt;/li&gt;&lt;li&gt;Normas de origen y propiedad de los datos&lt;/li&gt;&lt;li&gt;Restricciones en la replicaci&#243;n y el acceso&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Est&#225;ndares de aplicaciones:&lt;/b&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Aplicaciones est&#225;ndar/compartidas compatibles con funciones empresariales espec&#237;ficas&lt;/li&gt;&lt;li&gt;Normas para la comunicaci&#243;n e interoperaci&#243;n de aplicaciones&lt;/li&gt;&lt;li&gt;Est&#225;ndares de acceso, presentaci&#243;n y estilo&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Est&#225;ndares tecnol&#243;gicos;&lt;/b&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Productos de hardware est&#225;ndar&lt;/li&gt;&lt;li&gt;Productos de software est&#225;ndar&lt;/li&gt;&lt;li&gt;Est&#225;ndares para el desarrollo de software&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;br/&gt;&lt;b&gt;37.5 Registro de gobernanza&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.5.1 Visi&#243;n general&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />El Registro de Gobernanza proporciona un &#225;rea de repositorio para almacenar informaci&#243;n compartida relacionada con la gobernanza en curso de los proyectos. Mantener un repositorio compartido de informaci&#243;n de gobernanza es importante porque:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Las decisiones tomadas durante los proyectos (como las desviaciones de los est&#225;ndares o la justificaci&#243;n de un enfoque arquitect&#243;nico en particular) son importantes para retener y acceder de forma continua.&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Por ejemplo, si se va a reemplazar un sistema, tener en cuenta las decisiones arquitect&#243;nicas clave que dieron forma a la implementaci&#243;n inicial es muy valioso, ya que resaltar&#225; las restricciones que de otro modo podr&#237;an oscurecerse.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Muchas partes interesadas est&#225;n interesadas en el resultado de la gobernanza del proyecto (por ejemplo, otros proyectos, clientes del proyecto, la Junta de Arquitectura, etc.)&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.5.2 Contenido del registro de gobernanza&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />El registro de gobierno debe contener los siguientes elementos:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Registro de decisiones:&lt;/b&gt; un registro de todas las decisiones arquitect&#243;nicamente significativas que se han tomado en la organizaci&#243;n.&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Esto normalmente incluir&#237;a:&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Selecciones de productos&lt;/li&gt;&lt;li&gt;Justificaci&#243;n de las principales caracter&#237;sticas arquitect&#243;nicas de los proyectos&lt;/li&gt;&lt;li&gt;Desviaciones est&#225;ndar&lt;/li&gt;&lt;li&gt;Cambios en el ciclo de vida de los est&#225;ndares&lt;/li&gt;&lt;li&gt;Evaluaciones y aprobaciones de solicitudes de cambio&lt;/li&gt;&lt;li&gt;Evaluaciones de reutilizaci&#243;n&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Evaluaciones de cumplimiento:&lt;/b&gt; en los hitos clave del punto de control en el progreso de un proyecto, se llevar&#225; a cabo una revisi&#243;n formal de la arquitectura&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Esta revisi&#243;n medir&#225; el cumplimiento del proyecto con los est&#225;ndares de arquitectura definidos. Para cada proyecto, este registro debe incluir:&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Descripci&#243;n general del proyecto&lt;/li&gt;&lt;li&gt;Visi&#243;n general del progreso (cronograma, estado, problemas, riesgos, dependencias, etc.)&lt;/li&gt;&lt;li&gt;Listas de comprobaci&#243;n de arquitectura completadas&lt;/li&gt;&lt;li&gt;Evaluaci&#243;n del cumplimiento de las normas&lt;/li&gt;&lt;li&gt;Acciones recomendadas&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Evaluaciones de capacidad:&lt;/b&gt; dependiendo de sus objetivos, algunos proyectos llevar&#225;n a cabo evaluaciones de capacidad de negocio, TI o arquitectura.&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Estas evaluaciones deben llevarse a cabo y rastrearse peri&#243;dicamente para garantizar que se est&#225;n logrando los progresos adecuados. Este registro debe incluir:&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Plantillas y modelos de referencia para ejecutar evaluaciones de capacidad&lt;/li&gt;&lt;li&gt;Evaluaciones de capacidad empresarial&lt;/li&gt;&lt;li&gt;Evaluaciones de capacidad, madurez e impacto de TI&lt;/li&gt;&lt;li&gt;Evaluaciones de madurez de la arquitectura&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Calendario:&lt;/b&gt; el calendario debe mostrar un calendario de proyectos en vuelo y sesiones formales de revisi&#243;n que se llevar&#225;n a cabo contra estos proyectos.&lt;/li&gt;&lt;li&gt;&lt;b&gt;Portafolio de proyectos:&lt;/b&gt; el portafolio de proyectos debe contener informaci&#243;n resumida sobre todos los proyectos en curso que caen bajo la gobernanza de arquitectura, incluyendo:&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;El nombre y la descripci&#243;n del proyecto&lt;/li&gt;&lt;li&gt;Alcance arquitect&#243;nico del proyecto&lt;/li&gt;&lt;li&gt;Roles y responsabilidades arquitect&#243;nicas asociadas con el proyecto&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;b&gt;Medici&#243;n del rendimiento:&lt;/b&gt; sobre la base de una carta para la funci&#243;n de arquitectura, normalmente se definir&#225;n una serie de criterios de rendimiento.&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;El registro de medici&#243;n del rendimiento debe capturar las m&#233;tricas relacionadas con la gobernanza del proyecto y cualquier otra m&#233;trica de rendimiento relacionada con la carta de arquitectura para que el rendimiento pueda medirse y evaluarse de forma continua.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;37.6 El repositorio de requisitos de arquitectura&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.6.1 Visi&#243;n general&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />El Repositorio de requisitos de arquitectura es utilizado por todas las fases del M&#233;todo de desarrollo de arquitectura (ADM) para registrar y administrar toda la informaci&#243;n relevante para los requisitos de arquitectura. Los requisitos abordan los muchos tipos de requisitos de arquitectura; es decir, los requisitos estrat&#233;gicos, de segmento y de capacidad, que son los principales impulsores de la arquitectura empresarial.&lt;br/&gt;&lt;br/&gt;Los requisitos se pueden recopilar en cada etapa del ciclo de vida del desarrollo de la arquitectura y deben aprobarse a trav&#233;s de las diversas fases y procesos de gobierno.&lt;br/&gt;&lt;br/&gt;La fase de Gesti&#243;n de Requisitos es responsable de la gesti&#243;n de los contenidos del Repositorio de Requisitos de Arquitectura y de garantizar la integridad de todos los requisitos y su disponibilidad para el acceso por todas las fases.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.6.2 Contenido del repositorio de requisitos de arquitectura&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />El Repositorio de requisitos de arquitectura contiene los requisitos arquitect&#243;nicos del estado requerido de la empresa en momentos particulares. Debido al gran volumen y las diversas necesidades de las partes interesadas a lo largo del ciclo de vida de la arquitectura empresarial, los requisitos de arquitectura se dividen en tres niveles de granularidad:&lt;br/&gt;&lt;br/&gt;&lt;ol&gt;<br />&lt;li&gt;&lt;b&gt;&lt;i&gt;Los requisitos de arquitectura estrat&#233;gica&lt;/i&gt;&lt;/b&gt; muestran una vista resumida a largo plazo de los requisitos para toda la empresa.&lt;/li&gt;&lt;/ol&gt;<br />Los requisitos de arquitectura estrat&#233;gica identifican los requisitos operativos y de cambio para el establecimiento de la direcci&#243;n a nivel ejecutivo.&lt;br/&gt;&lt;br/&gt;&lt;ol&gt;<br />&lt;li&gt;&lt;b&gt;&lt;i&gt;Los requisitos de arquitectura de segmento&lt;/i&gt;&lt;/b&gt; proporcionan requisitos de modelo operativo m&#225;s detallados para las &#225;reas dentro de una empresa.&lt;/li&gt;&lt;/ol&gt;<br />Los requisitos de arquitectura de segmento pueden identificar requisitos a nivel de programa o cartera para identificar y alinear una actividad de cambio m&#225;s detallada.&lt;br/&gt;&lt;br/&gt;&lt;ol&gt;<br />&lt;li&gt;&lt;b&gt;&lt;i&gt;Los requisitos de arquitectura de capacidad&lt;/i&gt;&lt;/b&gt; identifican los requisitos detallados para una unidad de capacidad en particular.&lt;/li&gt;&lt;/ol&gt;<br />Los requisitos de arquitectura de capacidad identifican los requisitos para que los paquetes de trabajo y proyectos individuales se agrupen dentro de carteras y programas administrados.&lt;br/&gt;&lt;br/&gt;Los resultados empresariales para los requisitos de arquitectura se reflejar&#225;n en el panorama de soluciones a lo largo del tiempo. Cuando esto ocurre, los requisitos de arquitectura se cumplen y se archivan con fines de auditor&#237;a.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;37.7 Panorama de soluciones&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;El panorama de soluciones contiene los bloques de creaci&#243;n de soluciones (SB) que admiten los bloques de creaci&#243;n de arquitectura (ABB) especificados, desarrollados e implementados. Los bloques de construcci&#243;n pueden ser productos o servicios que pueden clasificarse de acuerdo con la categorizaci&#243;n de Enterprise Continuum y / o las especificaciones de ABB como SBB estrat&#233;gicos, de segmento o de capacidad.&lt;br/&gt;&lt;br/&gt;Los SBB tambi&#233;n pueden incluir herramientas, sistemas, servicios e informaci&#243;n que describen las soluciones reales que se pueden seleccionar y su funcionamiento. Por ejemplo, los modelos de referencia espec&#237;ficos del proveedor o los niveles 4 y 5 espec&#237;ficos del proveedor de la arquitectura de referencia de IT4IT se definir&#237;an aqu&#237;.&lt;br/&gt;&lt;br/&gt;Sin embargo, el Panorama de Soluciones no incluir&#225; la informaci&#243;n y el contenido de datos producidos por las soluciones seleccionadas; esa es la responsabilidad de las propias soluciones.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;37.8 El repositorio empresarial&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;Si bien el Repositorio de arquitectura contiene informaci&#243;n sobre la arquitectura empresarial y las especificaciones y artefactos asociados, hay un n&#250;mero considerable de repositorios empresariales que admiten la arquitectura tanto dentro como fuera de la empresa.&lt;br/&gt;&lt;br/&gt;Estos pueden incluir repositorios de desarrollo, entornos operativos espec&#237;ficos, instrucciones y repositorios de administraci&#243;n de configuraci&#243;n.&lt;br/&gt;&lt;br/&gt;&lt;b&gt;37.9 Repositorios externos&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.9.1 Modelos de referencia externos&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />Hay muchos modelos de referencia de la industria disponibles que pueden ayudar a comprender el papel y desarrollar las arquitecturas de referencia.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.9.2 Normas externas&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />Estos se relacionan con la industria, las mejores pr&#225;cticas o los est&#225;ndares formales definidos utilizados por las organizaciones l&#237;deres. Los ejemplos incluyen ISO, IEEE y est&#225;ndares gubernamentales.&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;i&gt;37.9.3 Aprobaciones de la Junta de Arquitectura&lt;/i&gt;&lt;/li&gt;&lt;/ul&gt;<br />Las decisiones tomadas por el Consejo de Arquitectura que afectan a la Arquitectura Empresarial a menudo se registran en las actas de las reuniones. Estas actas a menudo se guardan en archivos de documentaci&#243;n que se excluyen del Repositorio de Arquitectura por razones legales o reglamentarias.&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;&lt;i&gt;Fase Gesti&#243;n de Requisitos&lt;/i&gt;&lt;/b&gt;&lt;i&gt; &lt;/i&gt;&lt;br/&gt;es un recurso:&lt;b&gt; Insumos para la Gesti&#243;n de Requisitos&lt;/b&gt;.&lt;br/&gt;&lt;br/&gt;Los insumos para la fase de Gesti&#243;n de Requisitos son:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Un repositorio de arquitectura poblado (&lt;a href=&quot;file://file:///E:\Documents\MEGAsync\Debian_Archivos_2020\UE-2021\PreProyecto\Proyecto%20de%20Trabado%20de%20Grado\Togaf%209-2%20inicio\togaf92e-doc_1_paquete%20HTML\togaf92e-doc\arch\pt4.html&quot;&gt;&lt;font color=&quot;#00a6de&quot;&gt;&lt;i&gt;&lt;u&gt;Parte IV&lt;/u&gt;&lt;/i&gt;&lt;/font&gt;&lt;/a&gt;&lt;i&gt;, &lt;/i&gt;&lt;a href=&quot;file://file:///E:\Documents\MEGAsync\Debian_Archivos_2020\UE-2021\PreProyecto\Proyecto%20de%20Trabado%20de%20Grado\Togaf%209-2%20inicio\togaf92e-doc_1_paquete%20HTML\togaf92e-doc\arch\chap32.html \l tag_32_02_05&quot;&gt;&lt;font color=&quot;#00a6de&quot;&gt;&lt;i&gt;&lt;u&gt;32.2.5 Repositorio de arquitectura&lt;/u&gt;&lt;/i&gt;&lt;/font&gt;&lt;/a&gt;)&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;Recurso obtenido de la &lt;b&gt;&lt;i&gt;Fase Gesti&#243;n de Requisitos (Salida):&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;El Repositorio de requisitos de arquitectura se actualizar&#225; como parte de la fase de gesti&#243;n de requisitos y debe contener toda la informaci&#243;n de requisitos.&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;font color=&quot;#333333&quot;&gt;-Este entregable es un documento ya definido para la organizaci&#243;n, y es consumido y producido (puede tener alguna modificaci&#243;n) durante la fase actual. Pertenece a los entregables de arquitectura establecidos en la documentaci&#243;n del ADM y en la secci&#243;n 32. Entregables de arquitectura de la Parte IV: Marco de contenido de arquitectura. Existe una plantilla de apoyo para su modificaci&#243;n en: plantillas del Set 2 ofrecidas en la pagina oficial de la librer&#237;a TOGAF. &lt;/font&gt;Este artefacto se actualiza junto con la Especificaci&#243;n de requisitos de arquitectura (&lt;i&gt;32.2.6 Especificaci&#243;n de requisitos de arquitectura&lt;/i&gt;).&lt;font color=&quot;#333333&quot;&gt;-&lt;/font&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;&lt;i&gt;Fase Preliminar&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;Es recurso: &lt;b&gt;Entradas arquitect&#243;nicas&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Marco de arquitectura existente, si lo hubiera, que incluye:&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura ( Parte IV, 32.2.5 Repositorio de arquitectura).&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;Recurso obtenido de la&lt;b&gt;&lt;i&gt; Fase Preliminar (Salida):&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura inicial (Parte IV, 32.2.5 Repositorio de arquitectura), rellenado con contenido del marco.&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;font color=&quot;#333333&quot;&gt;-Este entregable es un documento ya definido para la organizaci&#243;n, y es consumido y producido (puede tener alguna modificaci&#243;n) durante la fase actual. Pertenece a los entregables de arquitectura establecidos en la documentaci&#243;n del ADM y en la secci&#243;n 32. Entregables de arquitectura de la Parte IV: Marco de contenido de arquitectura. Existe una plantilla de apoyo para su modificaci&#243;n en: plantillas del Set 2 ofrecidas en la pagina oficial de TOGAF.-&lt;/font&gt;&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;&lt;i&gt;Fase A:&lt;/i&gt;&lt;/b&gt;&lt;i&gt; &lt;/i&gt;&lt;b&gt;&lt;i&gt;Visi&#243;n de la arquitectura&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;es recurso: &lt;b&gt;Materiales de referencia externos a la empresa:&lt;/b&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Materiales de referencia de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;).&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;es recurso: &lt;b&gt;Entradas arquitect&#243;nicas:&lt;/b&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura rellenado (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;): documentaci&#243;n arquitect&#243;nica existente (descripci&#243;n del marco, descripciones arquitect&#243;nicas, descripciones de l&#237;nea base, ABB, etc.)&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;-Este es un recurso ya definido para la organizaci&#243;n, y es consumido para su uso durante la fase actual. Se establece como Entrada en la documentaci&#243;n del ADM y en la secci&#243;n 32. Entregables de arquitectura de la Parte IV: Marco de contenido de arquitectura.-&lt;br/&gt;&lt;br/&gt;Recurso obtenido de la &lt;b&gt;&lt;i&gt;Fase A (Salida):&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;Los resultados de la Fase A pueden incluir, pero no se limitan a:&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Contenido adicional que rellena el repositorio de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;).&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;-Este es un recurso que se actualiza durante la fase actual. Forma parte de las Salidas de la documentaci&#243;n de la fase ADM.-&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;&lt;i&gt;Fase B: Arquitectura de Negocios&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;Es recurso: &lt;b&gt;Materiales de referencia externos a la empresa:&lt;/b&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Materiales de referencia de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;)&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;Es recurso: &lt;b&gt;Entradas arquitect&#243;nicas:&lt;/b&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;), que incluye:&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Bloques de construcci&#243;n reutilizables&lt;/li&gt;&lt;li&gt;Modelos de referencia disponibles p&#250;blicamente&lt;/li&gt;&lt;li&gt;Modelos de referencia espec&#237;ficos de la organizaci&#243;n&lt;/li&gt;&lt;li&gt;Est&#225;ndares de organizaci&#243;n&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;-Este recurso contiene documentaci&#243;n que ya fue producida por la organizaci&#243;n y/o la arquitectura, y es consumida para su uso durante la fase actual. Se establece como Entrada en la documentaci&#243;n del ADM y en la secci&#243;n 32. Entregables de arquitectura de la Parte IV: Marco de contenido de arquitectura-&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;&lt;i&gt;Fase C: Arquitecturas de Sistemas de Informaci&#243;n&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;&lt;b&gt;&lt;i&gt;- &lt;/i&gt;&lt;/b&gt;&lt;b&gt;(&lt;/b&gt;&lt;b&gt;&lt;i&gt;Arquitectura de Datos&lt;/i&gt;&lt;/b&gt;&lt;b&gt;) &lt;/b&gt;&lt;b&gt;&lt;i&gt;- &lt;/i&gt;&lt;/b&gt;&lt;b&gt;(&lt;/b&gt;&lt;b&gt;&lt;i&gt;Arquitectura de Aplicaciones&lt;/i&gt;&lt;/b&gt;&lt;b&gt;):&lt;/b&gt;&lt;br/&gt;Es recurso: &lt;b&gt;Materiales de referencia externos a la empresa:&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Materiales de referencia de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;)&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;i&gt;Fase C: Arquitecturas de Sistemas de Informaci&#243;n &lt;/i&gt;&lt;b&gt;&lt;i&gt;- &lt;/i&gt;&lt;/b&gt;&lt;b&gt;(&lt;/b&gt;&lt;b&gt;&lt;i&gt;Arquitectura de Datos&lt;/i&gt;&lt;/b&gt;&lt;b&gt;):&lt;/b&gt;&lt;br/&gt;Es recurso: &lt;b&gt;Entradas arquitect&#243;nicas:&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;), que incluye:&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Bloques de construcci&#243;n reutilizables (en particular, definiciones de datos actuales)&lt;/li&gt;&lt;li&gt;Modelos de referencia disponibles p&#250;blicamente&lt;/li&gt;&lt;li&gt;Modelos de referencia espec&#237;ficos de la organizaci&#243;n&lt;/li&gt;&lt;li&gt;Est&#225;ndares o normas de organizaci&#243;n&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;br/&gt;&lt;br/&gt;&lt;i&gt;Fase C: Arquitecturas de Sistemas de Informaci&#243;n &lt;/i&gt;&lt;b&gt;&lt;i&gt;- &lt;/i&gt;&lt;/b&gt;&lt;b&gt;(&lt;/b&gt;&lt;b&gt;&lt;i&gt;Arquitectura de Aplicaciones&lt;/i&gt;&lt;/b&gt;&lt;b&gt;):&lt;/b&gt;&lt;br/&gt;Es recurso: &lt;b&gt;Entradas arquitect&#243;nicas:&lt;/b&gt;&lt;br/&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;), que incluye:&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Bloques de construcci&#243;n reutilizables&lt;/li&gt;&lt;li&gt;Modelos de referencia disponibles p&#250;blicamente&lt;/li&gt;&lt;li&gt;Modelos de referencia espec&#237;ficos de la organizaci&#243;n&lt;/li&gt;&lt;li&gt;Est&#225;ndares o normas de organizaci&#243;n&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />-Este recurso contiene documentaci&#243;n que ya fue producida por la organizaci&#243;n y/o la arquitectura, y es consumida para su uso durante la fase actual. Se establece como Entrada en la documentaci&#243;n del ADM y en la secci&#243;n 32. Entregables de arquitectura de la Parte IV: Marco de contenido de arquitectura-&lt;br/&gt;&lt;br/&gt;&lt;br/&gt;&lt;b&gt;&lt;i&gt;Fase D: Arquitectura Tecnol&#243;gica&lt;/i&gt;&lt;/b&gt;&lt;br/&gt;Es recurso: &lt;b&gt;Materiales de referencia externos a la empresa:&lt;/b&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Materiales de referencia de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;)&lt;/li&gt;&lt;/ul&gt;<br />&lt;br/&gt;Es recurso: &lt;b&gt;Entradas arquitect&#243;nicas:&lt;/b&gt;&lt;br/&gt;&lt;ul&gt;<br />&lt;li&gt;Repositorio de arquitectura (&lt;i&gt;Parte IV, 32.2.5 Repositorio de arquitectura&lt;/i&gt;), que incluye:&lt;/li&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;Bloques de construcci&#243;n reutilizables&lt;/li&gt;&lt;li&gt;Modelos de referencia disponibles p&#250;blicamente&lt;/li&gt;&lt;li&gt;Modelos de referencia espec&#237;ficos de la organizaci&#243;n&lt;/li&gt;&lt;li&gt;Est&#225;ndares o normas de organizaci&#243;n&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;<br />&lt;ul&gt;<br />&lt;li&gt;&lt;ul&gt;<br />&lt;li&gt;&lt;/li&gt;&lt;li&gt;&lt;/li&gt;&lt;/ul&gt;<br />&lt;/li&gt;&lt;br/&gt;&lt;/ul&gt;&lt;p/&gt;</div>

	<div class="TableGroup" id="TableGroup">
		<ul class="ItemTitle">
			<li onClick="toggleItem('AssociationsTo');" id="AssociationsToTitle">Associations To</li>
			<li onClick="toggleItem('AssociationsFrom');" id="AssociationsFromTitle">Associations From</li>
			<li onClick="toggleItem('FlowTo');" id="FlowToTitle">Flow To</li>
			<li onClick="toggleItem('CustomProperties');" id="CustomPropertiesTitle">Advanced</li>
			<li onClick="toggleItem('Links');" id="LinksTitle">Other Links</li>
		</ul>
		<div class="ItemBody" id="AssociationsToTable">
			<table class="Table ea_table">
				<tr>
					<td width="40%" class="TableHeading">Element</td>
					<td width="30%" class="TableHeading">Source Role</td>
					<td width="30%" class="TableHeading">Target Role</td>
				</tr>
				<tr>
					<td width="40%" class="TableRow" valign="top">
						<a href="EA250.htm">Objetos del negocios de la Fase Premilinar</a><br />
						Class &nbsp;
					</td>
					<td width="30%" class="TableRow" valign="top">
						<strong>Name:</strong> &nbsp;<br />
						&nbsp;
					</td>
					<td width="30%" class="TableRow" valign="top">
						<strong>Name:</strong> &nbsp;<br />
						&nbsp;	
					</td>
				</tr>
				<tr>
					<td class="TableRowBottomDashed"  colspan="3">
						<div class="DetailsDivParent"><button onclick="switchProjectProperties()"><img src="../../../../images/minus03.gif" align="absmiddle" id="DetailsImageLink390" /></button>Details:
							<div id="detailsDIVLink390" class="DetailsDiv" >
							&nbsp;
							</div>
						</div>
					</td>
				</tr>
				<tr>
					<td width="40%" class="TableRow" valign="top">
						<a href="EA210.htm">«recurso» Bloques de construcción de arquitectura -ABBs-</a><br />
						Class &nbsp;
					</td>
					<td width="30%" class="TableRow" valign="top">
						<strong>Name:</strong> &nbsp;<br />
						&nbsp;
					</td>
					<td width="30%" class="TableRow" valign="top">
						<strong>Name:</strong> &nbsp;<br />
						&nbsp;	
					</td>
				</tr>
				<tr>
					<td class="TableRowBottomDashed"  colspan="3">
						<div class="DetailsDivParent"><button onclick="switchProjectProperties()"><img src="../../../../images/minus03.gif" align="absmiddle" id="DetailsImageLink391" /></button>Details:
							<div id="detailsDIVLink391" class="DetailsDiv" >
							&nbsp;
							</div>
						</div>
					</td>
				</tr>

			</table>
		</div>
		<div class="ItemBody" id="AssociationsFromTable">
			<table class="Table ea_table">
				<tr>
					<td width="40%" class="TableHeading">Element</td>
					<td width="30%" class="TableHeading">Source Role</td>
					<td width="30%" class="TableHeading">Target Role</td>
				</tr>
				<tr>
					<td width="40%" class="TableRow" valign="top">
						<a href="EA263.htm">«DataStore» Repositorio de Arquitectura</a><br />
						DataStore &nbsp;
					</td>
					<td width="30%" class="TableRow" valign="top">
						<strong>Name:</strong> &nbsp;<br />
						&nbsp;
					</td>
					<td width="30%" class="TableRow" valign="top">
						<strong>Name:</strong> &nbsp;<br />
						&nbsp;	
					</td>
				</tr>
				<tr>
					<td class="TableRowBottomDashed"  colspan="3">
						<div class="DetailsDivParent"><button onclick="switchProjectProperties()"><img src="../../../../images/minus03.gif" align="absmiddle" id="DetailsImageLink392" /></button>Details:
							<div id="detailsDIVLink392" class="DetailsDiv" >
							&nbsp;
							</div>
						</div>
					</td>
				</tr>

			</table>
		</div>
		<div class="ItemBody" id="FlowToTable">
			<table class="Table ea_table">
				<tr>
					<td width="50%" class="TableHeading">Element</td>
					<td width="50%" class="TableHeading">Name</td>
				</tr>
				<tr>
					<td width="50%" class="TableRow" valign="top">
						<a href="../EA4/EA2/EA6/EA1293.htm">Preliminar</a><br />
						Activity &nbsp;
					</td>
					<td width="50%" class="TableRow" valign="top">&nbsp;</td>					
				</tr>
				<tr>
					<td class="TableRowBottomDashed"  colspan="2">
						<div class="DetailsDivParent"><button onclick="switchProjectProperties()"><img src="../../../../images/minus03.gif" align="absmiddle" id="DetailsImageLinkFlow393" /></button>Details:
							<div id="detailsDIVLinkFlow393" class="DetailsDiv" >
							&nbsp;
							</div>
						</div>
					</td>
				</tr>
			</table>
		</div>
		<div class="ItemBody" id="CustomPropertiesTable">
			<table class="Table ea_table">
				<tr>
					<td width="30%" class="TableHeading">Property</td>
					<td width="70%" class="TableHeading">Value</td>
				</tr>
			<tr>
				<td width="30%" class="TableRow">isFinalSpecialization:</td>
				<td width="70%" class="TableRow">0</td>
			</tr>


			</table>
		</div>		<div class="ItemBody" id="LinksTable">
			<table class="Table ea_table">
				<tr>
					<td width="30%" class="TableHeading">Object</td>
					<td width="10%" class="TableHeading">Type</td>
					<td width="10%" class="TableHeading">Connection</td>
					<td width="10%" class="TableHeading">Direction</td>
					<td width="40%" class="TableHeading">Notes</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA2/EA4/EA1275.htm">«Fase ADM» D: Arquitectura Tecnológica</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA1/EA626.htm">«Activity» 1. Seleccionar modelos de referencia, puntos de vista y herramientas</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA6/EA3/EA1205.htm">«Activity» Adaptación de procesos</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA2/EA1/EA1/EA857.htm">«Activity» Recopilar modelos relacionados con datos de materiales existentes de arquitectura del negocio y arquitectura de aplicaciones</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="EA216.htm">Entradas arquitectónicas</a></td>
					<td width="10%" class="TableRow" valign="top">Class</td>
					<td width="10%" class="TableRow" valign="top">Generalization</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA2/EA769.htm">«Activity» 1. Seleccionar modelos de referencia, puntos de vista y herramientas</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA4/EA905.htm">«Activity» 3. Desarrollar la descripción de la arquitectura de la tecnología de destino</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA1/EA1/EA389.htm">«Activity» Proporcionar instrucciones sobre qué productos de trabajo existentes, incluidos los bloques de construcción, deberán cambiarse y garantizar la coordinación de todas las actividades y dependencias de estos.</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA2/EA770.htm">«Activity» 2. Desarrollar la descripción de la arquitectura de datos de línea base</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="EA263.htm">«DataStore» Repositorio de Arquitectura</a></td>
					<td width="10%" class="TableRow" valign="top">DataStore</td>
					<td width="10%" class="TableRow" valign="top">Strong</td>
					<td width="10%" class="TableRow" valign="top">From</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA2/EA5/EA1283.htm">«Fase ADM» Gestión de Requisitos</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="EA237.htm">Materiales de referencia externos a la empresa</a></td>
					<td width="10%" class="TableRow" valign="top">Class</td>
					<td width="10%" class="TableRow" valign="top">Generalization</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="EA218.htm">«entregable» Entregables</a></td>
					<td width="10%" class="TableRow" valign="top">Class</td>
					<td width="10%" class="TableRow" valign="top">Generalization</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA1/EA1/EA1/EA708.htm">«Activity» Comprender la lista de aplicaciones o componentes de aplicaciones que se requieren, en función del portafolio de aplicaciones de línea base, cuáles son los requisitos y el ámbito de la arquitectura del negocio</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA2/EA477.htm">«Activity» 1. Seleccionar modelos de referencia, puntos de vista y herramientas</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA2/EA1/EA524.htm">«Activity» 1.1 Determinar el proceso general de modelado</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA2/EA3/EA1/EA1255.htm">«Fase ADM» C: Arquitecturas de Sistemas de Información - Arquitectura de Aplicaciones</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA4/EA903.htm">«Activity» 1. Seleccionar modelos de referencia, puntos de vista y herramientas</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA2/EA3/EA588.htm">«Activity» Seleccionar estándares para cada uno de los bloques de construcción, reutilizando tanto como sea posible de los modelos de referencia seleccionados del Repositorio de arquitectura</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA1/EA365.htm">«Activity» 6. Definir el alcance</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA2/EA479.htm">«Activity» 3. Desarrollar la descripción de la arquitectura del negocio objetivo</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA2/EA478.htm">«Activity» 2. Desarrollar una descripción de la arquitectura del negocio de línea de base</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA2/EA3/EA575.htm">«Activity» Documentar el mapeo final de la arquitectura dentro del Repositorio de Arquitectura</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA1/EA361.htm">«Activity» 2. Identificar a las partes interesadas, las preocupaciones y los requisitos comerciales</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA2/EA3/EA889.htm">«Activity» Seleccionar estándares para cada uno de los bloques de construcción, reutilizando tanto como sea posible de los modelos de referencia seleccionados del Repositorio de arquitectura</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA5/EA1076.htm">«DataStore» Repositorio de requisitos de arquitectura</a></td>
					<td width="10%" class="TableRow" valign="top">DataStore</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA1/EA1/EA677.htm">«Activity» 1.1 Determinar el proceso general de modelado</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA6/EA1151.htm">«Activity» 6. Desarrollar una estrategia y un plan de implementación de herramientas y técnicas</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA2/EA2/EA1242.htm">«Fase ADM» B: Arquitectura de Negocios</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA2/EA771.htm">«Activity» 3. Desarrollar la descripción de la arquitectura de datos de destino</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA2/EA1/EA1232.htm">«Fase ADM» A: Visión de la Arquitectura</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA1/EA4/EA424.htm">«Activity» Documentar los nuevos requisitos dentro de la Especificación de Requisitos de Arquitectura, y los nuevos requisitos que estén fuera del alcance de los requisitos seleccionados, ingresarlos al Repositorio de Requisitos.</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA2/EA3/EA2/EA1265.htm">«Fase ADM» C: Arquitecturas de Sistemas de Información - Arquitectura de Datos</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA4/EA1/EA948.htm">«Activity» 1.1 Determinar el proceso general de modelado</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA3/EA2/EA1/EA820.htm">«Activity» 1.1 Determinar el proceso general de modelado</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="EA252.htm">«recurso» Otros Recursos</a></td>
					<td width="10%" class="TableRow" valign="top">Class</td>
					<td width="10%" class="TableRow" valign="top">Generalization</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA4/EA1/EA1/EA985.htm">«Activity» Definir una taxonomía de servicios tecnológicos y componentes de tecnología lógica (incluidos estándares)</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA2/EA2/EA562.htm">«Activity» Anote los cambios en el punto de vista representado en los modelos seleccionados del Repositorio de arquitectura y el documento</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>
				<tr>
					<td width="30%" class="TableRow" valign="top"><a href="../EA4/EA1/EA1/EA3/EA410.htm">«Activity» Definir los activos arquitectónicos que se aprovecharán para su uso, desde continuum empresarial.</a></td>
					<td width="10%" class="TableRow" valign="top">Activity</td>
					<td width="10%" class="TableRow" valign="top">Dependency</td>
					<td width="10%" class="TableRow" valign="top">To</td>
					<td width="40%" class="TableRow" valign="top">&nbsp;</td>
				</tr>

			</table>
		</div>
	</div>
 </div>
 </td>
				</tr>
			</tbody>
		</table>
		
</div>
</body>
</html>

